#新建窗口
"""
思路：
1、创建窗体
2、创建组件，这里创建的为“按钮”，组件继承窗体
3、创建组件标识，这里标识为text,文字表示为“点我送花”
4、创建事件方法，事件的触发对象
5、创建触发事件的形式：鼠标、键盘等等
6、调用mainloop()方法，进入事件循环，即操作系统监控事件的发生
"""


from tkinter import *
from tkinter import messagebox

############创建窗体#############
#定义窗体
root = Tk()
#定义窗体标题
root.title("第一个GUI程序")
#定义窗体尺寸"高x宽+距离屏幕左边框+距离屏幕上边框"。注意：高"x"宽，中间不是乘号，是"x"
root.geometry("500x300+100+200")

################################

############创建组件############

btn01 = Button(root)
btn01["text"] = "点我送花"
btn01.pack()              #布局管理器，把组件放在窗体里，按钮大小适应文字

###############################

####################创建事件内容#################

def songhua(e):         #"e"是事件对象
    messagebox.showinfo("message","送你花吧")      #"message"为类型为"标题"，标题内容为"送你花吧"
    print("运行成功")

#################################################

###################创建事件的触发方式###################

btn01.bind("<Button-1>",songhua)        #"<Button-1>"为事件：点击鼠标左键，触发songhua()方法

######################################################

root.mainloop()        #调用组件的mainloop()方法，进入事件循环